<?php

return [
    /*
     |--------------------------------------------------------------------------
     | Versión principal de la API
     |--------------------------------------------------------------------------
     */
    'version' => env('API_VERSION', 'v1'),

    /*
     |--------------------------------------------------------------------------
     | Subdominio (opcional).  Ej.: 'api'  →  api.midominio.cl
     | Déjalo null si usarás el dominio principal.
     |--------------------------------------------------------------------------
     */
    'subdomain' => env('API_SUBDOMAIN', null),
];
